---
type: ImportIFCOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# ImportIFCOptions

`Autodesk.Revit.DB.ImportIFCOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetImportIFCOptions | 2024 | `public static ImportIFCOptions GetImportIFCOptions ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LinkProcessor | 2024 | `public string LinkProcessor { get ; set ; }` |